[M_TempleTower MissionDefinition]
MissionSummary="Protect Murderlin's son."

[M_TempleTower:DefendTheTower MissionObjectiveDefinition]
ProgressMessage="Defend tower"

[M_TempleTower:RaiseTower MissionObjectiveDefinition]
ProgressMessage="Speak to son"

[M_TempleTower:RaiseTowerSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Murderlin The Wizard has asked you to babysit his son, Murderlin Jr., for a little while.<br><br>Upon reaching Murderlin's son, however, you discovered that a horde of baddies is hellbent on killing him. Murderlin the Wizard has asked you to protect his son at all costs -- if the baddos can destroy Murderlin Jr's tower, it's over."
